{"3452669": "To : Whom It May concern : I am writing to dispute a fraudulent charge on my account in the amount of {$10000.00}, {$2000.00}, {$8900.00}, {$12000.00}, {$4000.00}, {$4500.00}, {$6100.00}, {$10000.00}, {$15000.00}, {$9100.00}, {$52.00}.\n\nI am a victim of Identity theft, and I did not make or authorize this charge. I am requesting that the charge be removed, that any finance and other charges related to the fraudulent amount be credited, as well, and that I receive an accurate statement. This request is made pursuant to the Fair Credit Billing Acts amendments to the Truth in Lending Act, 15 U.S.C. 1666-1666b, 12 C.F.R 226.13. See also 12 C.F.R 226.12 ( b ).\n\n-OPEN ACCOUNT- 1. XXXX XXXX  with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$10000.00} -This is not my account. \n\n\n-CLOSED ACCOUNTS- 2. XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$2000.00} -This is not my account.\n\n3. XXXX  XXXX XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$8900.00} -This is not my account.\n\n4. XXXX  XXXX XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$12000.00} -This is not my account. \n\n5. XXXX XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$4000.00} -This is not my account.\n\n6. XXXX/XXXX  with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$4500.00} -This is not my account. \n\n-PERSONAL ACCOUNTS- 7. XXXX XXXX XXXX  with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$6100.00} -This is not my account. \n\n8. XXXX XXXX XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$10000.00} -This is not my account.\n\n9. XXXX XXXX XXXX  with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$15000.00} -This is not my account. \n\n10. XXXX XXXX XXXX  with ACCT # XXXX opened on XXXX   XXXX, XXXX with a credit limit of {$9100.00} -This is not my account. \n\n-COLLECTION ACCOUNT- 11. XXXX XXXX XXXX with ACCT # XXXX opened on XX/XX/XXXX with a credit limit of {$52.00} -This is not my account.", "3183010": "I'm not even sure what debt they are talking about. There were calling me incessantly and would not tell me who they were. If I answered, they would transfer me to an automated message to leave my information. \n\nThe only bill I thought could have been outstanding was a doctor bill from XX/XX/2018. I have called the doctor 's office and my insurance paid. I have a XXXX balance. \n\nI do not owe anyone any money ; I have impeccable credit. I have also just checked my credit report, in case of identity theft. My credit report is perfect. \n\nThey are now calling my work number ; I am a XXXX XXXX and it rings in my XXXX. I have been forced to unplug the phone. \n\nThe name of the company is Evergreen Professional Recovery, headquartered in XXXX Washington.", "3197548": "Wells Fargo has sent me several general form letters in regard to opening of unauthorized accounts and resolution of fees charged to these accounts, the letters want to know if I am satisfied with resolution.. The resolution includes a refund check in the amount of XXXX. This is the only refund I received, which does not cover total fees charged including overdraft fees.. This refund was made as part of Wells Fargo Settlement which again, is only a small portion of fees charged to unauthorized accounts which I believe include a total of two or three. The fees run into the hundreds I believe, however, I do not have an exact total as the accounts are all now closed and do not have access to them. I request a refund of total fees charged to these accounts which were not authorized. Failing that, I request Wells Fargo to cease sending these letters asking if I am satisfied with resolution as I am clearly not.", "3135671": "Company has wrote the loan amount off as a loss meaning they got paid for it due to writing the loan off as a loss but still shows on my credit report and are calling me trying to still get paid for the left over amount meaning they are getting paid twice for the delinquent amount.", "3298765": "I was recently sued by Portfolio Recovery Associates for a credit card debt but I informed them that I was unable to come to court due to the fact that I couldnt risk leaving my elderly mother alone because of her late-stage XXXX and other health issues and that I was willing to settle the debt before the court date of XX/XX/XXXX in exchange that they would cancel all collections activities which includes dropping the lawsuit against me. They agreed to cancel all collections activity on this very same online website a month ago, but they have not honored our agreement. The courts still made a judgment against me due to the fact that I didnt appear in court. The courts may very well arrest me because of that.", "3199080": "XXXX XXXX XXXX, XXXX, XXXX and XXXX is reporting on my credit report a collection that claims I owe no debt to. I have no contract with this creditor and have no information about this said debt.", "3284745": "XXXX XXXX XXXX XXXX XXXX XXXX XXXX XXXX FL XXXX OPTIMUM OUTCOMES INC XXXX XXXX XXXX XXXX XXXX XXXX XXXX, IL XXXX XXXX : XXXX ; XXXX ; XXXX ; XXXX To Whom It May Concern : This letter is being sent to you in response to notices sent to me from your company and more importantly, due to your erroneous reporting to the Credit Bureau { s }, the highly negative impact on my personal credit report. Please be advised that this is not a refusal to pay, but a notice sent pursuant to the Fair Debt Collection Practices Act, 15 USC 1692g Sec. 809 { b } that your claim is disputed and validation is requested. This is NOT a request for verification or proof of my mailing address, but a request for VALIDATION made pursuant to the above-named Title and Section. I respectfully request that your offices provide me with  competent evidence that I have any legal obligation to pay you. Please provide me with the following : What the money you say I owe is for : Explain and show me how you calculated what you say I owe : Provide me with copies of any papers that show I agreed to pay what you say I owe : Provide a verification or copy of any judgment if applicable : Identify the original creditor : Prove the Statute of Limitations has not expired on this account : Show me the you are licensed to collect in my state : Provide me with your license numbers and Registered Agent or Agent of Service : At this time, I will also inform you that if your offices have reported invalidated information to any of the 3 major Credit Bureaus { XXXX, XXXX or XXXX } this action might constitute fraud under both Federal and State Laws. Due to this fact, if any negative mark is found on any of my credit reports by your company or the company that you represent, I will not hesitate to bring legal action against you for the following : Violation of the Fair Credit Reporting Act Violation of the Fair Debt Collection Practices Act Defamation of Character If your offices can provide proper documentation as requested in the following Declaration, I will require at least 30 days to investigate this information and during such time all collection activity must cease and desist. Also, during this validation period, if any action is taken which could be considered detrimental to any of my credit reports, I will consult with my legal counsel for suit. This includes listing any information with a credit reporting repository that could be inaccurate or invalidated or verifying an account as accurate, when in fact there is no provided proof that it is accurate. If your company fails to respond to this validation request within 30 days from the date of your receipt, all references to this account must be deleted and completely removed from my credit report and a copy of such deletion { to any/all of the 3 major credit reporting bureaus : XXXX, XXXX and XXXX } request shall be sent to me immediately. I would also like to request, in writing, that no telephone contact be made by your company to my home or my place of employment. If your offices attempt telephone communication with me, including but not limited to computer generated calls and calls or correspondence sent to or with any third parties, it will be considered harassment and I will have no choice but to file suit. All future communications with me MUST be done in writing and sent to the address noted in this letter by USPS. It would be advisable that you assure your records are in order before I am forced to take legal action against your company and your client. This is an attempt to correct your records, any information obtained shall be used for that purpose. Best Regards, XXXX XXXX.", "3200778": "RE : Misleading offer from UMB Bank Visa Signature Card.\n\nOffer States : \" 20,000 bonus point offer when you spend {$1500.00} in the first 90 days of opening your account. You may even choose to redeem your 20,000 points for {$200.00} cash back or use it for other great rewards! '' Does not state in offer any delay in having points credited to your account for redeeming the reward. Other credit card companies apply the points to your account upon your monthly statement when qualifying for the reward. \n\nI did contact by phone UMB Bank and was told they did not have a rewards department or contact person and that any qualifying points that I was entitled to would be delayed from being added to my account after 90 days and one to two billing cycles of the card. This wasn't specified in the written promotional offer, making it impossible for any cardholder to be aware of the delay in receiving the bonus reward. \n\nI made numerous phone calls over a 2-day period ( XX/XX/2019 & XX/XX/2019 ) to have my reward points applied to the credit balance on my account only to be mistreated and given a vague response. \n\nPlease note the offer states \" WHEN '' I spend {$1500.00}, which means at that present time qualifying for purchases of {$1500.00}. UMB Bank is not abiding by the terms stated in the offer.", "3196958": "XXXX has been reported on my credit report which I am unaware of who they are.I worked with XXXX law to get this removed in the past and it was removed from XXXX but not XXXX. I did not open this account back in XXXX of 2017 and have no recollection of this account but it is still being reported.", "3193419": "I received a notice on my credit report for debt owed from Phoenix Financial Services. I called the company who is handling the debt. They started to read off dates and amounts, telling me they were \" medical bills ''. I asked for written information on the debt owed, dates and who they were owed to. The guy informed me all he had to do was legally tell me how much was owed, he didn't have to tell me who it was owed to. He told me to call my insurance company to ask.", "3237808": "I checked my report recently and noticed that you did not remove it. \nAmericredit Inquiry from XX/XX/2019 Why is that? It appears to me that you don't care about my rights and my creditworthiness.", "3320800": "Experian, XXXX, XXXX  Are reporting items that are old that were included in a chapter XXXX bankruptcy some accounts are closed with a XXXX XXXX5 years old.", "3190481": "I noticed American Expess on my credit report supposedly stating their company loan money to me. I have sent them multiple letters requesting answers to questions that they should be able to answer as a company. I have sought after someone with firsthand knowledge. That could tell me more about this alleged account and give me answers. Unfortunately they can not answer them and have not taken their Tradeline off my credit report. With not responding and not showing proof that the company has loan money to me from their own funds. They do not have a legal right to be on my report. Ive sent them question they chose to ignore and not answer. These question would give me a good look if they indeed loan money from their own funds to me, complied with the truth and leading act, and has a legal right to collect on this alleged loan. American Express to this day, has not been able to answer.", "3192867": "Equifax and XXXX are reporting incorrectly that I am 120 days past due on the XXXX - ( Please see page 4 and 5 of  the attached credit report. ) These accounts reflect a {$0.00} balance and {$0.00} past due. This incorrect reporting is harming my credit scores. It is impossible to be late on accounts that have a {$0.00} balance and {$0.00} past due.", "3411274": "Information belongs to someone else", "3194836": "Hello, I have reached out to XXXX XXXX and XXXX XXXX, 1 ) to ask for a copy of my credit reports that they have with my information. I have contacted and called them without receiving a report. They have things on my credit that are not correct and need to be corrected. 2 ) HIPPA violators : I have doctor bills from XXXX ( XXXX XXXX, XXXX, Commonwealth Financial & XXXX XXXX ) and the other hospital is XXXX XXXX XXXX that were also paid either through medicaid from the past, charity, and employee insurance. I also have copies of the letters from the hospitals themselves, that I was approved for hardship and they paid the bills. For some reason, not through the not hospitals, they are still being reported negatively to my credit. They are not supposed keep passing to the next creditor after being paid. Against the law. They were to be paid in full and never late. 3 ) Lastly, I have inquiries on my credit that I have not sign up for. Why is it that companies can pull my credit, they do not leave my account for two years, but they bring my score down when they want? I thought my credit was for me to mess up and not others who are trying to get business? How is this fair to me? I want to be compensated if someone pulls my credit without my say so, but their pull can bring my score down. This is not fair to me and my money, due to lower scores I pay more in the end. It really is an insult when I pay companies to correct credit and my score goes up, but then right back down cause inquiries from others are pulling when they want. I want a copy of my reports to sent from ALL companies like XXXX XXXX, XXXX XXXX, and etc. It is my information and that is my right. I would like for the inquiries to stop without me freezing my accounts. Why should they be able to pull my credit to see if I qualify for anything before I am in need of it. How can paid doctor bills report negatively, with XXXX balance, and states it is paid in full? Then they just add an extra number to the account number and make it look as if I have two accounts for something paid? These are unfair practices and I have paperwork. But once I state the obvious, I am marked for life. Please help to correct these issues by numbers. I have tried to send the paperwork into the bureaus, even though it is on the companies letterhead, they would not accept it. Totally confused. So if the company never corrects or reports to the bureaus, I just suffer? Still spending money with companies to assist with credit repairs and steady wasting money due to these issues. since 2006 to present. 4 ) I also have a letter from one of the companies stating that they were going to correct the owed amount in 30 days due to them using unfair credit practices and that was part of their law suit. Still waiting on that and have not gotten one answer after contacting. Its easier to fax my documents instead of uploading. Be on the look out.", "3199163": "OnXX/XX/2019 I applied for a VA home loan through Chaos Home loans everything was going good and we where supposed to close XX/XX/2019 that didnt happen and got pushed to the XXXX that didnt happen either we finally signed papers on the XXXX of XX/XX/2019 since then they have not funded the loan they keep coming back and saying there is an issue and they need more documentation I send it to them they tell the title company the funds ha e been sent then say it is held up by the bank. To make a long story short we keep getting lied to here it is XX/XX/2019 and they still have not funded the loan. I have a numourouse amounts of text and emails showing everything I am saying.", "3200997": "This account has a XXXX balance and was paid to XXXX XXXX XXXX via Federal Income Tax Return being garnished in 2012 and I am constantly being harassed saying I have an open account with XXXX XXXX XXXX when I don't have any active contracts with this company. There is a XXXX   balance as seen attached. Please have company delete both accounts as they are paid in full : Account # XXXX Account # XXXX Thank you, XXXX XXXX Last Four SSN # XXXX", "3212242": "Bank of America has failed to send payment to me after checks they sent me were returned to them or XXXX XXXX or XXXX Bank. These checks were returned by XXXX as I no longer lived at the address where they sent them. XXXX XXXX XXXX calls and tells me that Bank of America will reimburse me {$360000.00} yet I have received nothing : FACT : XXXX XXXX XXXX XXXX XXXX calls ( XX/XX/XXXX XXXX tell me I will be receiving checks for {$360000.00}. B of A calls and tells me same. Due to loan servicing errors and equity I will be receiving check/checks from RUST soon. We know that as many as XXXX people are in the same position as me. LOST CHECKS, RETURNED as UNDELIVERABLE Sent to wrong person. Most of them were found and paid. \n\nFOIA Paragraph from Letter of XX/XX/XXXX from XXXX XXXX XXXX FOIA request through my letter to head of XXXX XXXX XXXX XX/XX/XXXX. \n\n\" The OCCs enforcement action that led to your payment originated from examinations conducted in the fourth quarter of XXXX and is described in the report available at http : XXXX. The consent orders involving your specific servicer are also available online at http : //www.occ.gov/independentforeclosurereview '' XXXX, XXXX XXXX XXXX XXXX XXXX. \nXXXX of XXXX XXXX and XXXX of XXXX XXXX XXXX", "3229299": "Good morning my name is XXXX XXXX and I appreciate it if you could help me put a stop to Chase Bank cardmember services. \nIn 2018 I wrote to Chase asking for debt verification and what they sent me a statement which is not acceptable. I am asking the bank to validate the debt. Instead I been receiving mail every month from them attempting to collect a debt. \nI have a right to know this information as a consumer. \n\nChase account # XXXX XXXX XXXX XXXX Thanks in advance for your help."}